{
  "metadata": {
    "sources": [
      "Matthew Henry",
      "John Gill"
    ],
    "total_commentaries": 7,
    "processing_date": "2025-09-01T02:12:09.830Z",
    "theological_tags": [
      "genealogy",
      "messiah",
      "covenant",
      "prophecy",
      "salvation",
      "trinity",
      "eschatology",
      "ethics",
      "worship",
      "discipleship"
    ]
  },
  "commentaries": {
    "matthew_1_1": [
      {
        "source": "Matthew Henry",
        "text": "The book of the generation of Jesus Christ. The New Testament begins with the account of Jesus Christ, and this account begins with his pedigree. This is called the book of the generation of Jesus Christ, the son of David, the son of Abraham. Christ is called the son of David because he was the son of Mary, who was of the house and lineage of David, and Joseph also was of that royal family. He is called the son of Abraham, because Abraham was the first that received the promise of the Messiah.",
        "preview": "The book of the generation of Jesus Christ. The New Testament begins with the account of Jesus Christ, and this account begins with his pedigree. This is called the book of the generation of Jesus...",
        "theological_tags": [
          "genealogy",
          "messiah",
          "covenant",
          "trinity"
        ],
        "length": 498
      },
      {
        "source": "John Gill",
        "text": "The book of the generation of Jesus Christ, the son of David, the son of Abraham. This verse contains the title and argument of the whole Gospel. It is called the book of the generation, because it gives an account of the genealogy of Christ, and of his birth and life. Jesus Christ is here described by his names and titles. He is called Jesus, which signifies a saviour, because he came to save his people from their sins. He is called Christ, which signifies anointed, because he was anointed with the Holy Spirit above measure.",
        "preview": "The book of the generation of Jesus Christ, the son of David, the son of Abraham. This verse contains the title and argument of the whole Gospel. It is called the book of the generation, because it...",
        "theological_tags": [
          "genealogy",
          "messiah",
          "trinity",
          "ethics"
        ],
        "length": 531
      }
    ],
    "matthew_1_2": [
      {
        "source": "Matthew Henry",
        "text": "Abraham begat Isaac. The genealogy here does not begin with Adam, but with Abraham, because to him was the promise made. The Jews were generally careful to preserve their genealogies, and Matthew gives us the genealogy of Joseph, who, though not the father of our Lord Jesus Christ, was the husband of his mother, and was supposed to be his father.",
        "preview": "Abraham begat Isaac. The genealogy here does not begin with Adam, but with Abraham, because to him was the promise made. The Jews were generally careful to preserve their genealogies, and Matthew...",
        "theological_tags": [
          "genealogy",
          "messiah",
          "covenant",
          "trinity"
        ],
        "length": 348
      },
      {
        "source": "John Gill",
        "text": "Abraham begat Isaac; and Isaac begat Jacob; and Jacob begat Judah and his brethren. The evangelist begins the genealogy with Abraham, the father of the Jewish nation, to whom the promise of the Messiah was first made. The genealogy is traced through the line of Judah, from whom came the sceptre, and to whom the gathering of the people was to be.",
        "preview": "Abraham begat Isaac; and Isaac begat Jacob; and Jacob begat Judah and his brethren. The evangelist begins the genealogy with Abraham, the father of the Jewish nation, to whom the promise of the...",
        "theological_tags": [
          "genealogy",
          "messiah",
          "covenant",
          "trinity"
        ],
        "length": 347
      }
    ],
    "matthew_1_16": [
      {
        "source": "Matthew Henry",
        "text": "And Jacob begat Joseph the husband of Mary, of whom was born Jesus, who is called Christ. Here we have the birth of our blessed Saviour. Joseph is called the husband of Mary, though they were not yet come together. Mary is said to be the mother of Jesus, who is called Christ, that is, the Anointed, the Messiah promised to the fathers.",
        "preview": "And Jacob begat Joseph the husband of Mary, of whom was born Jesus, who is called Christ. Here we have the birth of our blessed Saviour. Joseph is called the husband of Mary, though they were not yet...",
        "theological_tags": [
          "messiah",
          "covenant",
          "trinity"
        ],
        "length": 336
      },
      {
        "source": "John Gill",
        "text": "And Jacob begat Joseph the husband of Mary, of whom was born Jesus, who is called Christ. Joseph is called the husband of Mary, though they were only espoused, according to the Jewish custom. The text carefully notes that Jesus was born of Mary, not of Joseph, indicating the virgin birth. The title Christ is added to distinguish this Jesus from others of the same name.",
        "preview": "And Jacob begat Joseph the husband of Mary, of whom was born Jesus, who is called Christ. Joseph is called the husband of Mary, though they were only espoused, according to the Jewish custom. The...",
        "theological_tags": [
          "messiah"
        ],
        "length": 371
      }
    ],
    "matthew_1_18": [
      {
        "source": "Matthew Henry",
        "text": "Now the birth of Jesus Christ was on this wise. Having given us his genealogy, the evangelist now gives us an account of his birth, which was altogether extraordinary. The conception of Christ in the womb of the virgin, without the concurrence of man, was a great mystery of godliness.",
        "preview": "Now the birth of Jesus Christ was on this wise. Having given us his genealogy, the evangelist now gives us an account of his birth, which was altogether extraordinary. The conception of Christ in the...",
        "theological_tags": [
          "genealogy",
          "messiah"
        ],
        "length": 285
      },
      {
        "source": "John Gill",
        "text": "Now the birth of Jesus Christ was on this wise: When his mother Mary had been betrothed to Joseph, before they came together she was found with child of the Holy Spirit. The miraculous conception is here described. Mary was betrothed to Joseph according to Jewish custom, but before their marriage was consummated, she was found to be with child through the power of the Holy Spirit, fulfilling ancient prophecy.",
        "preview": "Now the birth of Jesus Christ was on this wise: When his mother Mary had been betrothed to Joseph, before they came together she was found with child of the Holy Spirit. The miraculous conception is...",
        "theological_tags": [
          "messiah",
          "prophecy",
          "trinity"
        ],
        "length": 412
      }
    ],
    "matthew_1_21": [
      {
        "source": "Matthew Henry",
        "text": "And she shall bring forth a son; and thou shalt call his name Jesus; for it is he that shall save his people from their sins. The name Jesus signifies a Saviour. Christ came to save his people from their sins; this is the great errand upon which he came into the world. Sin is the worst of evils, and salvation from sin is the greatest of blessings.",
        "preview": "And she shall bring forth a son; and thou shalt call his name Jesus; for it is he that shall save his people from their sins. The name Jesus signifies a Saviour. Christ came to save his people from...",
        "theological_tags": [
          "messiah",
          "salvation",
          "trinity",
          "ethics"
        ],
        "length": 349
      },
      {
        "source": "John Gill",
        "text": "And she shall bring forth a son; and thou shalt call his name Jesus; for it is he that shall save his people from their sins. The angel declares the name to be given to the child, Jesus, which means Yahweh saves. The reason for this name is given - he shall save his people from their sins. This indicates both his divine nature and his mission of redemption.",
        "preview": "And she shall bring forth a son; and thou shalt call his name Jesus; for it is he that shall save his people from their sins. The angel declares the name to be given to the child, Jesus, which means...",
        "theological_tags": [
          "salvation",
          "trinity",
          "ethics"
        ],
        "length": 359
      }
    ],
    "matthew_1_23": [
      {
        "source": "Matthew Henry",
        "text": "Behold, the virgin shall be with child, and shall bring forth a son, And they shall call his name Immanuel; which is, being interpreted, God with us. This was spoken originally of Christ, and had its full accomplishment in him. By his incarnation, God is with us; in his person the two natures are united; by his spirit and grace he is with his people always.",
        "preview": "Behold, the virgin shall be with child, and shall bring forth a son, And they shall call his name Immanuel; which is, being interpreted, God with us. This was spoken originally of Christ, and had its...",
        "theological_tags": [
          "messiah",
          "salvation",
          "trinity"
        ],
        "length": 359
      }
    ],
    "matthew_7_14": [
      {
        "source": "John Gill",
        "text": "Behold, the virgin shall be with child, and shall bring forth a son, And they shall call his name Immanuel; which is, being interpreted, God with us. This quotes Isaiah 7:14, showing the fulfillment of messianic prophecy. The name Immanuel, meaning God with us, points to the incarnation - God taking human nature and dwelling among his people.",
        "preview": "Behold, the virgin shall be with child, and shall bring forth a son, And they shall call his name Immanuel; which is, being interpreted, God with us. This quotes Isaiah 7:14, showing the fulfillment...",
        "theological_tags": [
          "prophecy",
          "trinity"
        ],
        "length": 344
      }
    ]
  }
}